SpacehuhnTech/arduino/wifiduck/avr/boards.txt
menu.cpu=Processor
menu.keyboardid=USB Device ID
menu.protocol=Protocol
menu.debug=Debug
menu.ledpin=Neopixel (WS2812b)
menu.bridge=Serial Bridge
menu.bridgebutton=Serial Bridge Enable Pin
menu.bridgerst=Serial Bridge Reset Pin
menu.bridge0=Serial Bridge GPIO-0 Pin

######################################
########## DSTIKE WiFi Duck ##########
######################################
dstike.name=DSTIKE WiFi Duck (ATmega32u4)

dstike.upload.tool=avrdude
dstike.upload.protocol=avr109
dstike.upload.maximum_size=28672
dstike.upload.maximum_data_size=2560
dstike.upload.speed=57600
dstike.upload.disable_flushing=true
dstike.upload.use_1200bps_touch=true
dstike.upload.wait_for_upload_port=true

dstike.bootloader.tool=avrdude
dstike.bootloader.unlock_bits=0x3F
dstike.bootloader.lock_bits=0x2F
dstike.bootloader.low_fuses=0xFF
dstike.bootloader.high_fuses=0xD8

dstike.build.board=AVR_ATMEGA32U4
dstike.build.core=arduino
dstike.build.variant=dstike
dstike.build.mcu=atmega32u4

dstike.build.f_cpu=16000000L
dstike.bootloader.extended_fuses=0xCB
dstike.bootloader.file=Caterina-promicro16.hex

dstike.build.protocol_flags=-DENABLE_I2C
dstike.build.led_flags=-DNEOPIXEL -DNEOPIXEL_NUM=1
dstike.build.led_pin=-DLED_PIN=7

########## Keyboard ID ##########
dstike.menu.keyboardid.default=Arduino Leonardo
dstike.menu.keyboardid.default.build.vid=0x2341
dstike.menu.keyboardid.default.build.pid=0x8036
dstike.menu.keyboardid.default.build.usb_product="Leonardo"
dstike.menu.keyboardid.default.build.usb_manufacturer="Arduino"

dstike.menu.keyboardid.apple=Apple Aluminium Keyboard
dstike.menu.keyboardid.apple.build.vid=0x05ac
dstike.menu.keyboardid.apple.build.pid=0x0221
dstike.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
dstike.menu.keyboardid.apple.build.usb_manufacturer="Apple"

dstike.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
dstike.menu.keyboardid.appleint.build.vid=0x05ac
dstike.menu.keyboardid.appleint.build.pid=0x0259
dstike.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
dstike.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

dstike.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
dstike.menu.keyboardid.logitechhid.build.vid=0x046d
dstike.menu.keyboardid.logitechhid.build.pid=0xc316
dstike.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
dstike.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

dstike.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
dstike.menu.keyboardid.logitechgaming.build.vid=0x046d
dstike.menu.keyboardid.logitechgaming.build.pid=0xc335
dstike.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
dstike.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

dstike.menu.keyboardid.ms=Microsoft Keyboard
dstike.menu.keyboardid.ms.build.vid=0x045e
dstike.menu.keyboardid.ms.build.pid=0xfff8
dstike.menu.keyboardid.ms.build.usb_product="USB Keyboard"
dstike.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

########## Debug ##########
dstike.menu.debug.serial=Serial (115200b, newline)
dstike.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

dstike.menu.debug.disabled=Disabled


################################
###### Generic ATmega32u4 ######
################################

atmega32u4.name=Generic ATmega32u4

atmega32u4.upload.tool=avrdude
atmega32u4.upload.protocol=avr109
atmega32u4.upload.maximum_size=28672
atmega32u4.upload.maximum_data_size=2560
atmega32u4.upload.speed=57600
atmega32u4.upload.disable_flushing=true
atmega32u4.upload.use_1200bps_touch=true
atmega32u4.upload.wait_for_upload_port=true

atmega32u4.bootloader.tool=avrdude
atmega32u4.bootloader.unlock_bits=0x3F
atmega32u4.bootloader.lock_bits=0x2F
atmega32u4.bootloader.low_fuses=0xFF
atmega32u4.bootloader.high_fuses=0xD8

atmega32u4.build.board=AVR_ATMEGA32U4
atmega32u4.build.core=arduino
atmega32u4.build.variant=atmega32u4
atmega32u4.build.mcu=atmega32u4

########## 5V / 16MHz ##########
atmega32u4.menu.cpu.16MHzatmega32U4=5V, 16 MHz

atmega32u4.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L
atmega32u4.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
atmega32u4.menu.cpu.16MHzatmega32U4.bootloader.file=Caterina-promicro16.hex

########## 3.3V / 8MHz ##########
atmega32u4.menu.cpu.8MHzatmega32U4=3.3V, 8 MHz

atmega32u4.menu.cpu.8MHzatmega32U4.build.f_cpu=8000000L
atmega32u4.menu.cpu.8MHzatmega32U4.bootloader.extended_fuses=0xFE
atmega32u4.menu.cpu.8MHzatmega32U4.bootloader.file=Caterina-promicro8.hex

########## Keyboard ID ##########
atmega32u4.menu.keyboardid.default=Arduino Leonardo
atmega32u4.menu.keyboardid.default.build.vid=0x2341
atmega32u4.menu.keyboardid.default.build.pid=0x8036
atmega32u4.menu.keyboardid.default.build.usb_product="Leonardo"
atmega32u4.menu.keyboardid.default.build.usb_manufacturer="Arduino"

atmega32u4.menu.keyboardid.apple=Apple Aluminium Keyboard
atmega32u4.menu.keyboardid.apple.build.vid=0x05ac
atmega32u4.menu.keyboardid.apple.build.pid=0x0221
atmega32u4.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
atmega32u4.menu.keyboardid.apple.build.usb_manufacturer="Apple"

atmega32u4.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
atmega32u4.menu.keyboardid.appleint.build.vid=0x05ac
atmega32u4.menu.keyboardid.appleint.build.pid=0x0259
atmega32u4.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
atmega32u4.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

atmega32u4.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
atmega32u4.menu.keyboardid.logitechhid.build.vid=0x046d
atmega32u4.menu.keyboardid.logitechhid.build.pid=0xc316
atmega32u4.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
atmega32u4.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

atmega32u4.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
atmega32u4.menu.keyboardid.logitechgaming.build.vid=0x046d
atmega32u4.menu.keyboardid.logitechgaming.build.pid=0xc335
atmega32u4.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
atmega32u4.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

atmega32u4.menu.keyboardid.ms=Microsoft Keyboard
atmega32u4.menu.keyboardid.ms.build.vid=0x045e
atmega32u4.menu.keyboardid.ms.build.pid=0xfff8
atmega32u4.menu.keyboardid.ms.build.usb_product="USB Keyboard"
atmega32u4.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

