SpacehuhnTech/arduino/wifiduck/avr/boards.txt
########## Protocol ##########
atmega32u4.menu.protocol.auto=Auto (I2C & Serial)
atmega32u4.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

atmega32u4.menu.protocol.i2c=I2C
atmega32u4.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

atmega32u4.menu.protocol.serial=Serial
atmega32u4.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
atmega32u4.menu.debug.serial=Serial (115200b, newline)
atmega32u4.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

atmega32u4.menu.debug.disabled=Disabled

########## LED ##########
atmega32u4.menu.ledpin.disabled=Disabled
atmega32u4.menu.ledpin.0=0 (RX Serial) [PD2]
atmega32u4.menu.ledpin.0.build.led_pin=-DNEOPIXEL -DLED_PIN=0
atmega32u4.menu.ledpin.1=1 (TX Serial) [PD3]
atmega32u4.menu.ledpin.1.build.led_pin=-DNEOPIXEL -DLED_PIN=1
atmega32u4.menu.ledpin.2=2 (SDA I2C) [PD1]
atmega32u4.menu.ledpin.2.build.led_pin=-DNEOPIXEL -DLED_PIN=2
atmega32u4.menu.ledpin.3=3 (SCL I2C) [PD0]
atmega32u4.menu.ledpin.3.build.led_pin=-DNEOPIXEL -DLED_PIN=3
atmega32u4.menu.ledpin.4=4 (A6) [PD4]
atmega32u4.menu.ledpin.4.build.led_pin=-DNEOPIXEL -DLED_PIN=4
atmega32u4.menu.ledpin.5=5 [PC6]
atmega32u4.menu.ledpin.5.build.led_pin=-DNEOPIXEL -DLED_PIN=5
atmega32u4.menu.ledpin.6=6 (A7) [PD7]
atmega32u4.menu.ledpin.6.build.led_pin=-DNEOPIXEL -DLED_PIN=6
atmega32u4.menu.ledpin.7=7 [PE6]
atmega32u4.menu.ledpin.7.build.led_pin=-DNEOPIXEL -DLED_PIN=7
atmega32u4.menu.ledpin.8=8 (A8) [PB4]
atmega32u4.menu.ledpin.8.build.led_pin=-DNEOPIXEL -DLED_PIN=8
atmega32u4.menu.ledpin.9=9 (A9) [PB5]
atmega32u4.menu.ledpin.9.build.led_pin=-DNEOPIXEL -DLED_PIN=9
atmega32u4.menu.ledpin.10=10 (A10) [PB6]
atmega32u4.menu.ledpin.10.build.led_pin=-DNEOPIXEL -DLED_PIN=10
atmega32u4.menu.ledpin.11=11 [PB7]
atmega32u4.menu.ledpin.11.build.led_pin=-DNEOPIXEL -DLED_PIN=11
atmega32u4.menu.ledpin.12=12 (A11) [PD6]
atmega32u4.menu.ledpin.12.build.led_pin=-DNEOPIXEL -DLED_PIN=12
atmega32u4.menu.ledpin.13=13 [PC7]
atmega32u4.menu.ledpin.13.build.led_pin=-DNEOPIXEL -DLED_PIN=13
atmega32u4.menu.ledpin.14=14 (MISO SPI) [PB3]
atmega32u4.menu.ledpin.14.build.led_pin=-DNEOPIXEL -DLED_PIN=14
atmega32u4.menu.ledpin.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.ledpin.15.build.led_pin=-DNEOPIXEL -DLED_PIN=15
atmega32u4.menu.ledpin.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.ledpin.16.build.led_pin=-DNEOPIXEL -DLED_PIN=16
atmega32u4.menu.ledpin.17=17 (SS SPI) [PB0]
atmega32u4.menu.ledpin.17.build.led_pin=-DNEOPIXEL -DLED_PIN=17
atmega32u4.menu.ledpin.18=18 (A0) [PF7]
atmega32u4.menu.ledpin.18.build.led_pin=-DNEOPIXEL -DLED_PIN=18
atmega32u4.menu.ledpin.19=19 (A1) [PF6]
atmega32u4.menu.ledpin.19.build.led_pin=-DNEOPIXEL -DLED_PIN=19
atmega32u4.menu.ledpin.20=20 (A2) [PF5]
atmega32u4.menu.ledpin.20.build.led_pin=-DNEOPIXEL -DLED_PIN=20
atmega32u4.menu.ledpin.21=21 (A3) [PF4]
atmega32u4.menu.ledpin.21.build.led_pin=-DNEOPIXEL -DLED_PIN=21
atmega32u4.menu.ledpin.22=22 (A4) [PF1]
atmega32u4.menu.ledpin.22.build.led_pin=-DNEOPIXEL -DLED_PIN=22
atmega32u4.menu.ledpin.23=23 (A5) [PF0]
atmega32u4.menu.ledpin.23.build.led_pin=-DNEOPIXEL -DLED_PIN=23

########## Serial Bridge ##########
atmega32u4.menu.bridge.disabled=Disabled

atmega32u4.menu.bridge.serial1=Serial1
atmega32u4.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

atmega32u4.menu.bridgebutton.disabled=Disabled
atmega32u4.menu.bridgebutton.2=2 (SDA I2C) [PD1]
atmega32u4.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
atmega32u4.menu.bridgebutton.3=3 (SCL I2C) [PD0]
atmega32u4.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
atmega32u4.menu.bridgebutton.4=4 (A6) [PD4]
atmega32u4.menu.bridgebutton.4.build.bridge_button=-DBRIDGE_SWITCH=4
atmega32u4.menu.bridgebutton.5=5 [PC6]
atmega32u4.menu.bridgebutton.5.build.bridge_button=-DBRIDGE_SWITCH=5
atmega32u4.menu.bridgebutton.6=6 (A7) [PD7]
atmega32u4.menu.bridgebutton.6.build.bridge_button=-DBRIDGE_SWITCH=6
atmega32u4.menu.bridgebutton.7=7 [PE6]
atmega32u4.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=7
atmega32u4.menu.bridgebutton.8=8 (A8) [PB4]
atmega32u4.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=8
atmega32u4.menu.bridgebutton.9=9 (A9) [PB5]
atmega32u4.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
atmega32u4.menu.bridgebutton.10=10 (A10) [PB6]
atmega32u4.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
atmega32u4.menu.bridgebutton.11=11 [PB7]
atmega32u4.menu.bridgebutton.11.build.bridge_button=-DBRIDGE_SWITCH=11
atmega32u4.menu.bridgebutton.12=12 (A11) [PD6]
atmega32u4.menu.bridgebutton.12.build.bridge_button=-DBRIDGE_SWITCH=12
atmega32u4.menu.bridgebutton.13=13 [PC7]
atmega32u4.menu.bridgebutton.13.build.bridge_button=-DBRIDGE_SWITCH=13
atmega32u4.menu.bridgebutton.14=14 (MISO SPI) [PB3]
atmega32u4.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
atmega32u4.menu.bridgebutton.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
atmega32u4.menu.bridgebutton.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
atmega32u4.menu.bridgebutton.17=17 (SS SPI) [PB0]
atmega32u4.menu.bridgebutton.17.build.bridge_button=-DBRIDGE_SWITCH=17
atmega32u4.menu.bridgebutton.18=18 (A0) [PF7]
atmega32u4.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
atmega32u4.menu.bridgebutton.19=19 (A1) [PF6]
atmega32u4.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
atmega32u4.menu.bridgebutton.20=20 (A2) [PF5]
atmega32u4.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20
atmega32u4.menu.bridgebutton.21=21 (A3) [PF4]
atmega32u4.menu.bridgebutton.21.build.bridge_button=-DBRIDGE_SWITCH=21
atmega32u4.menu.bridgebutton.22=22 (A4) [PF1]
atmega32u4.menu.bridgebutton.22.build.bridge_button=-DBRIDGE_SWITCH=22
atmega32u4.menu.bridgebutton.23=23 (A5) [PF0]
atmega32u4.menu.bridgebutton.23.build.bridge_button=-DBRIDGE_SWITCH=23

atmega32u4.menu.bridgerst.disabled=Disabled
atmega32u4.menu.bridgerst.2=2 (SDA I2C) [PD1]
atmega32u4.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
atmega32u4.menu.bridgerst.3=3 (SCL I2C) [PD0]
atmega32u4.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
atmega32u4.menu.bridgerst.4=4 (A6) [PD4]
atmega32u4.menu.bridgerst.4.build.bridge_rst=-DBRIDGE_RST=4
atmega32u4.menu.bridgerst.5=5 [PC6]
atmega32u4.menu.bridgerst.5.build.bridge_rst=-DBRIDGE_RST=5
atmega32u4.menu.bridgerst.6=6 (A7) [PD7]
atmega32u4.menu.bridgerst.6.build.bridge_rst=-DBRIDGE_RST=6
atmega32u4.menu.bridgerst.7=7 [PE6]
atmega32u4.menu.bridgerst.7.build.bridge_rst=-DBRIDGE_RST=7
atmega32u4.menu.bridgerst.8=8 (A8) [PB4]
atmega32u4.menu.bridgerst.8.build.bridge_rst=-DBRIDGE_RST=8
atmega32u4.menu.bridgerst.9=9 (A9) [PB5]
atmega32u4.menu.bridgerst.9.build.bridge_rst=-DBRIDGE_RST=9
atmega32u4.menu.bridgerst.10=10 (A10) [PB6]
atmega32u4.menu.bridgerst.10.build.bridge_rst=-DBRIDGE_RST=10
atmega32u4.menu.bridgerst.11=11 [PB7]
atmega32u4.menu.bridgerst.11.build.bridge_rst=-DBRIDGE_RST=11
atmega32u4.menu.bridgerst.12=12 (A11) [PD6]
atmega32u4.menu.bridgerst.12.build.bridge_rst=-DBRIDGE_RST=12
atmega32u4.menu.bridgerst.13=13 [PC7]
atmega32u4.menu.bridgerst.13.build.bridge_rst=-DBRIDGE_RST=13
atmega32u4.menu.bridgerst.14=14 (MISO SPI) [PB3]
atmega32u4.menu.bridgerst.14.build.bridge_rst=-DBRIDGE_RST=14
atmega32u4.menu.bridgerst.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.bridgerst.15.build.bridge_rst=-DBRIDGE_RST=15
atmega32u4.menu.bridgerst.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.bridgerst.16.build.bridge_rst=-DBRIDGE_RST=16
atmega32u4.menu.bridgerst.17=17 (SS SPI) [PB0]
atmega32u4.menu.bridgerst.17.build.bridge_rst=-DBRIDGE_RST=17
atmega32u4.menu.bridgerst.18=18 (A0) [PF7]
atmega32u4.menu.bridgerst.18.build.bridge_rst=-DBRIDGE_RST=18
atmega32u4.menu.bridgerst.19=19 (A1) [PF6]
atmega32u4.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
atmega32u4.menu.bridgerst.20=20 (A2) [PF5]
atmega32u4.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20
atmega32u4.menu.bridgerst.21=21 (A3) [PF4]
atmega32u4.menu.bridgerst.21.build.bridge_rst=-DBRIDGE_RST=21
atmega32u4.menu.bridgerst.22=22 (A4) [PF1]
atmega32u4.menu.bridgerst.22.build.bridge_rst=-DBRIDGE_RST=22
atmega32u4.menu.bridgerst.23=23 (A5) [PF0]
atmega32u4.menu.bridgerst.23.build.bridge_rst=-DBRIDGE_RST=23

