SpacehuhnTech/arduino/wifiduck/avr/boards.txt
atmega32u4.menu.bridge0.disabled=Disabled
atmega32u4.menu.bridge0.2=2 (SDA I2C) [PD1]
atmega32u4.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
atmega32u4.menu.bridge0.3=3 (SCL I2C) [PD0]
atmega32u4.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
atmega32u4.menu.bridge0.4=4 (A6) [PD4]
atmega32u4.menu.bridge0.4.build.bridge_0=-DBRIDGE_0=4
atmega32u4.menu.bridge0.5=5 [PC6]
atmega32u4.menu.bridge0.5.build.bridge_0=-DBRIDGE_0=5
atmega32u4.menu.bridge0.6=6 (A7) [PD7]
atmega32u4.menu.bridge0.6.build.bridge_0=-DBRIDGE_0=6
atmega32u4.menu.bridge0.7=7 [PE6]
atmega32u4.menu.bridge0.7.build.bridge_0=-DBRIDGE_0=7
atmega32u4.menu.bridge0.8=8 (A8) [PB4]
atmega32u4.menu.bridge0.8.build.bridge_0=-DBRIDGE_0=8
atmega32u4.menu.bridge0.9=9 (A9) [PB5]
atmega32u4.menu.bridge0.9.build.bridge_0=-DBRIDGE_0=9
atmega32u4.menu.bridge0.10=10 (A10) [PB6]
atmega32u4.menu.bridge0.10.build.bridge_0=-DBRIDGE_0=10
atmega32u4.menu.bridge0.11=11 [PB7]
atmega32u4.menu.bridge0.11.build.bridge_0=-DBRIDGE_0=11
atmega32u4.menu.bridge0.12=12 (A11) [PD6]
atmega32u4.menu.bridge0.12.build.bridge_0=-DBRIDGE_0=12
atmega32u4.menu.bridge0.13=13 [PC7]
atmega32u4.menu.bridge0.13.build.bridge_0=-DBRIDGE_0=13
atmega32u4.menu.bridge0.14=14 (MISO SPI) [PB3]
atmega32u4.menu.bridge0.14.build.bridge_0=-DBRIDGE_0=14
atmega32u4.menu.bridge0.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.bridge0.15.build.bridge_0=-DBRIDGE_0=15
atmega32u4.menu.bridge0.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.bridge0.16.build.bridge_0=-DBRIDGE_0=16
atmega32u4.menu.bridge0.17=17 (SS SPI) [PB0]
atmega32u4.menu.bridge0.17.build.bridge_0=-DBRIDGE_0=17
atmega32u4.menu.bridge0.18=18 (A0) [PF7]
atmega32u4.menu.bridge0.18.build.bridge_0=-DBRIDGE_0=18
atmega32u4.menu.bridge0.19=19 (A1) [PF6]
atmega32u4.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
atmega32u4.menu.bridge0.20=20 (A2) [PF5]
atmega32u4.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20
atmega32u4.menu.bridge0.21=21 (A3) [PF4]
atmega32u4.menu.bridge0.21.build.bridge_0=-DBRIDGE_0=21
atmega32u4.menu.bridge0.22=22 (A4) [PF1]
atmega32u4.menu.bridge0.22.build.bridge_0=-DBRIDGE_0=22
atmega32u4.menu.bridge0.23=23 (A5) [PF0]
atmega32u4.menu.bridge0.23.build.bridge_0=-DBRIDGE_0=23

################################
###### Arduino Leonardo ########
################################

leonardo.name=Arduino Leonardo

leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F
leonardo.bootloader.low_fuses=0xFF
leonardo.bootloader.high_fuses=0xD8

leonardo.build.board=AVR_ATMEGA32U4
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.mcu=atmega32u4

leonardo.build.f_cpu=16000000L
leonardo.bootloader.extended_fuses=0xCB
leonardo.bootloader.file=Caterina-Leonardo.hex

########## Keyboard ID ##########
leonardo.menu.keyboardid.default=Arduino Leonardo
leonardo.menu.keyboardid.default.build.vid=0x2341
leonardo.menu.keyboardid.default.build.pid=0x8036
leonardo.menu.keyboardid.default.build.usb_product="Leonardo"
leonardo.menu.keyboardid.default.build.usb_manufacturer="Arduino"

leonardo.menu.keyboardid.apple=Apple Aluminium Keyboard
leonardo.menu.keyboardid.apple.build.vid=0x05ac
leonardo.menu.keyboardid.apple.build.pid=0x0221
leonardo.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
leonardo.menu.keyboardid.apple.build.usb_manufacturer="Apple"

leonardo.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
leonardo.menu.keyboardid.appleint.build.vid=0x05ac
leonardo.menu.keyboardid.appleint.build.pid=0x0259
leonardo.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
leonardo.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

leonardo.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
leonardo.menu.keyboardid.logitechhid.build.vid=0x046d
leonardo.menu.keyboardid.logitechhid.build.pid=0xc316
leonardo.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
leonardo.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

leonardo.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
leonardo.menu.keyboardid.logitechgaming.build.vid=0x046d
leonardo.menu.keyboardid.logitechgaming.build.pid=0xc335
leonardo.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
leonardo.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

leonardo.menu.keyboardid.ms=Microsoft Keyboard
leonardo.menu.keyboardid.ms.build.vid=0x045e
leonardo.menu.keyboardid.ms.build.pid=0xfff8
leonardo.menu.keyboardid.ms.build.usb_product="USB Keyboard"
leonardo.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

########## Protocol ##########
leonardo.menu.protocol.auto=Auto (I2C & Serial)
leonardo.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

leonardo.menu.protocol.i2c=I2C
leonardo.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

leonardo.menu.protocol.serial=Serial
leonardo.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
leonardo.menu.debug.serial=Serial (115200b, newline)
leonardo.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

leonardo.menu.debug.disabled=Disabled

########## LED ##########
leonardo.menu.ledpin.disabled=Disabled
leonardo.menu.ledpin.0=0 (RX Serial)
leonardo.menu.ledpin.0.build.led_pin=-DNEOPIXEL -DLED_PIN=0
leonardo.menu.ledpin.1=1 (TX Serial)
leonardo.menu.ledpin.1.build.led_pin=-DNEOPIXEL -DLED_PIN=1
leonardo.menu.ledpin.2=2 (SDA I2C)
leonardo.menu.ledpin.2.build.led_pin=-DNEOPIXEL -DLED_PIN=2
leonardo.menu.ledpin.3=~3 (SCL I2C)
leonardo.menu.ledpin.3.build.led_pin=-DNEOPIXEL -DLED_PIN=3
leonardo.menu.ledpin.4=4
leonardo.menu.ledpin.4.build.led_pin=-DNEOPIXEL -DLED_PIN=4
leonardo.menu.ledpin.5=~5
leonardo.menu.ledpin.5.build.led_pin=-DNEOPIXEL -DLED_PIN=5
leonardo.menu.ledpin.6=~6
leonardo.menu.ledpin.6.build.led_pin=-DNEOPIXEL -DLED_PIN=6
leonardo.menu.ledpin.7=7
leonardo.menu.ledpin.7.build.led_pin=-DNEOPIXEL -DLED_PIN=7
leonardo.menu.ledpin.8=8
leonardo.menu.ledpin.8.build.led_pin=-DNEOPIXEL -DLED_PIN=8
leonardo.menu.ledpin.9=~9
leonardo.menu.ledpin.9.build.led_pin=-DNEOPIXEL -DLED_PIN=9
leonardo.menu.ledpin.10=~10
leonardo.menu.ledpin.10.build.led_pin=-DNEOPIXEL -DLED_PIN=10
leonardo.menu.ledpin.11=~11
leonardo.menu.ledpin.11.build.led_pin=-DNEOPIXEL -DLED_PIN=11
leonardo.menu.ledpin.12=~12
leonardo.menu.ledpin.12.build.led_pin=-DNEOPIXEL -DLED_PIN=12
leonardo.menu.ledpin.13=~13
leonardo.menu.ledpin.13.build.led_pin=-DNEOPIXEL -DLED_PIN=13
leonardo.menu.ledpin.14=ICSP MISO (SPI)
leonardo.menu.ledpin.14.build.led_pin=-DNEOPIXEL -DLED_PIN=14
leonardo.menu.ledpin.15=ICSP SCLK (SPI)
leonardo.menu.ledpin.15.build.led_pin=-DNEOPIXEL -DLED_PIN=15
leonardo.menu.ledpin.16=ICSP MOSI (SPI)
leonardo.menu.ledpin.16.build.led_pin=-DNEOPIXEL -DLED_PIN=16
leonardo.menu.ledpin.18=A0
leonardo.menu.ledpin.18.build.led_pin=-DNEOPIXEL -DLED_PIN=18
leonardo.menu.ledpin.19=A1
leonardo.menu.ledpin.19.build.led_pin=-DNEOPIXEL -DLED_PIN=19
leonardo.menu.ledpin.20=A2
leonardo.menu.ledpin.20.build.led_pin=-DNEOPIXEL -DLED_PIN=20
leonardo.menu.ledpin.21=A3
leonardo.menu.ledpin.21.build.led_pin=-DNEOPIXEL -DLED_PIN=21
leonardo.menu.ledpin.22=A4
leonardo.menu.ledpin.22.build.led_pin=-DNEOPIXEL -DLED_PIN=22
leonardo.menu.ledpin.23=A5
leonardo.menu.ledpin.23.build.led_pin=-DNEOPIXEL -DLED_PIN=23

########## Serial Bridge ##########
leonardo.menu.bridge.disabled=Disabled

leonardo.menu.bridge.serial1=Serial1
leonardo.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

leonardo.menu.bridgebutton.disabled=Disabled
leonardo.menu.bridgebutton.2=2 (SDA I2C)
leonardo.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
leonardo.menu.bridgebutton.3=~3 (SCL I2C)
leonardo.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
leonardo.menu.bridgebutton.4=4
leonardo.menu.bridgebutton.4.build.bridge_button=-DBRIDGE_SWITCH=4
leonardo.menu.bridgebutton.5=~5
leonardo.menu.bridgebutton.5.build.bridge_button=-DBRIDGE_SWITCH=5
leonardo.menu.bridgebutton.6=~6
leonardo.menu.bridgebutton.6.build.bridge_button=-DBRIDGE_SWITCH=6
leonardo.menu.bridgebutton.7=7
leonardo.menu.bridgebutton.7.build.bridge_button=-DBRIDGE_SWITCH=7
leonardo.menu.bridgebutton.8=8
leonardo.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=8
leonardo.menu.bridgebutton.9=~9
leonardo.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
leonardo.menu.bridgebutton.10=~10
leonardo.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
leonardo.menu.bridgebutton.11=~11
leonardo.menu.bridgebutton.11.build.bridge_button=-DBRIDGE_SWITCH=11
leonardo.menu.bridgebutton.12=~12
leonardo.menu.bridgebutton.12.build.bridge_button=-DBRIDGE_SWITCH=12
leonardo.menu.bridgebutton.13=~13
leonardo.menu.bridgebutton.13.build.bridge_button=-DBRIDGE_SWITCH=13
leonardo.menu.bridgebutton.14=ICSP MISO (SPI)
leonardo.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
leonardo.menu.bridgebutton.15=ICSP SCLK (SPI)
leonardo.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
leonardo.menu.bridgebutton.16=ICSP MOSI (SPI)
leonardo.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
leonardo.menu.bridgebutton.18=A0
leonardo.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
leonardo.menu.bridgebutton.19=A1
leonardo.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
leonardo.menu.bridgebutton.20=A2
leonardo.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20
leonardo.menu.bridgebutton.21=A3
leonardo.menu.bridgebutton.21.build.bridge_button=-DBRIDGE_SWITCH=21
leonardo.menu.bridgebutton.22=A4
leonardo.menu.bridgebutton.22.build.bridge_button=-DBRIDGE_SWITCH=22
leonardo.menu.bridgebutton.23=A5
leonardo.menu.bridgebutton.23.build.bridge_button=-DBRIDGE_SWITCH=23

leonardo.menu.bridgerst.disabled=Disabled
leonardo.menu.bridgerst.2=2 (SDA I2C)
leonardo.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
leonardo.menu.bridgerst.3=~3 (SCL I2C)
leonardo.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
leonardo.menu.bridgerst.4=4
leonardo.menu.bridgerst.4.build.bridge_rst=-DBRIDGE_RST=4
leonardo.menu.bridgerst.5=~5
leonardo.menu.bridgerst.5.build.bridge_rst=-DBRIDGE_RST=5
leonardo.menu.bridgerst.6=~6
leonardo.menu.bridgerst.6.build.bridge_rst=-DBRIDGE_RST=6
leonardo.menu.bridgerst.7=7
leonardo.menu.bridgerst.7.build.bridge_rst=-DBRIDGE_RST=7
leonardo.menu.bridgerst.8=8
leonardo.menu.bridgerst.8.build.bridge_rst=-DBRIDGE_RST=8
leonardo.menu.bridgerst.9=~9
leonardo.menu.bridgerst.9.build.bridge_rst=-DBRIDGE_RST=9
leonardo.menu.bridgerst.10=~10
leonardo.menu.bridgerst.10.build.bridge_rst=-DBRIDGE_RST=10
leonardo.menu.bridgerst.11=~11
leonardo.menu.bridgerst.11.build.bridge_rst=-DBRIDGE_RST=11
leonardo.menu.bridgerst.12=~12
leonardo.menu.bridgerst.12.build.bridge_rst=-DBRIDGE_RST=12
leonardo.menu.bridgerst.13=~13
leonardo.menu.bridgerst.13.build.bridge_rst=-DBRIDGE_RST=13
leonardo.menu.bridgerst.14=ICSP MISO (SPI)
leonardo.menu.bridgerst.14.build.bridge_rst=-DBRIDGE_RST=14
leonardo.menu.bridgerst.15=ICSP SCLK (SPI)
leonardo.menu.bridgerst.15.build.bridge_rst=-DBRIDGE_RST=15
leonardo.menu.bridgerst.16=ICSP MOSI (SPI)
leonardo.menu.bridgerst.16.build.bridge_rst=-DBRIDGE_RST=16
leonardo.menu.bridgerst.18=A0
leonardo.menu.bridgerst.18.build.bridge_rst=-DBRIDGE_RST=18
leonardo.menu.bridgerst.19=A1
leonardo.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
leonardo.menu.bridgerst.20=A2
leonardo.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20
leonardo.menu.bridgerst.21=A3
leonardo.menu.bridgerst.21.build.bridge_rst=-DBRIDGE_RST=21
leonardo.menu.bridgerst.22=A4
leonardo.menu.bridgerst.222.build.bridge_rst=-DBRIDGE_RST=22
leonardo.menu.bridgerst.23=A5
leonardo.menu.bridgerst.23.build.bridge_rst=-DBRIDGE_RST=23

