SpacehuhnTech/arduino/wifiduck/avr/boards.txt
leonardo.menu.bridge0.disabled=Disabled
leonardo.menu.bridge0.2=2 (SDA I2C)
leonardo.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
leonardo.menu.bridge0.3=~3 (SCL I2C)
leonardo.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
leonardo.menu.bridge0.4=4
leonardo.menu.bridge0.4.build.bridge_0=-DBRIDGE_0=4
leonardo.menu.bridge0.5=~5
leonardo.menu.bridge0.5.build.bridge_0=-DBRIDGE_0=5
leonardo.menu.bridge0.6=~6
leonardo.menu.bridge0.6.build.bridge_0=-DBRIDGE_0=6
leonardo.menu.bridge0.7=7
leonardo.menu.bridge0.7.build.bridge_0=-DBRIDGE_0=7
leonardo.menu.bridge0.8=8
leonardo.menu.bridge0.8.build.bridge_0=-DBRIDGE_0=8
leonardo.menu.bridge0.9=~9
leonardo.menu.bridge0.9.build.bridge_0=-DBRIDGE_0=9
leonardo.menu.bridge0.10=~10
leonardo.menu.bridge0.10.build.bridge_0=-DBRIDGE_0=10
leonardo.menu.bridge0.11=~11
leonardo.menu.bridge0.11.build.bridge_0=-DBRIDGE_0=11
leonardo.menu.bridge0.12=~12
leonardo.menu.bridge0.12.build.bridge_0=-DBRIDGE_0=12
leonardo.menu.bridge0.13=~13
leonardo.menu.bridge0.13.build.bridge_0=-DBRIDGE_0=13
leonardo.menu.bridge0.14=ICSP MISO (SPI)
leonardo.menu.bridge0.14.build.bridge_0=-DBRIDGE_0=14
leonardo.menu.bridge0.15=ICSP SCLK (SPI)
leonardo.menu.bridge0.15.build.bridge_0=-DBRIDGE_0=15
leonardo.menu.bridge0.16=ICSP MOSI (SPI)
leonardo.menu.bridge0.16.build.bridge_0=-DBRIDGE_0=16
leonardo.menu.bridge0.18=A0
leonardo.menu.bridge0.18.build.bridge_0=-DBRIDGE_0=18
leonardo.menu.bridge0.19=A1
leonardo.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
leonardo.menu.bridge0.20=A2
leonardo.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20
leonardo.menu.bridge0.21=A3
leonardo.menu.bridge0.21.build.bridge_0=-DBRIDGE_0=21
leonardo.menu.bridge0.22=A4
leonardo.menu.bridge0.22.build.bridge_0=-DBRIDGE_0=22
leonardo.menu.bridge0.23=A5
leonardo.menu.bridge0.23.build.bridge_0=-DBRIDGE_0=23

################################
######## Arduino Micro #########
################################

micro.name=Arduino Micro

micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F
micro.bootloader.low_fuses=0xFF
micro.bootloader.high_fuses=0xD8

micro.build.board=AVR_ATMEGA32U4
micro.build.core=arduino
micro.build.variant=micro
micro.build.mcu=atmega32u4

micro.build.f_cpu=16000000L
micro.bootloader.extended_fuses=0xCB
micro.bootloader.file=Caterina-Micro.hex

########## Keyboard ID ##########
micro.menu.keyboardid.default=Arduino Leonardo
micro.menu.keyboardid.default.build.vid=0x2341
micro.menu.keyboardid.default.build.pid=0x8036
micro.menu.keyboardid.default.build.usb_product="Leonardo"
micro.menu.keyboardid.default.build.usb_manufacturer="Arduino"

micro.menu.keyboardid.apple=Apple Aluminium Keyboard
micro.menu.keyboardid.apple.build.vid=0x05ac
micro.menu.keyboardid.apple.build.pid=0x0221
micro.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
micro.menu.keyboardid.apple.build.usb_manufacturer="Apple"

micro.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
micro.menu.keyboardid.appleint.build.vid=0x05ac
micro.menu.keyboardid.appleint.build.pid=0x0259
micro.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
micro.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

micro.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
micro.menu.keyboardid.logitechhid.build.vid=0x046d
micro.menu.keyboardid.logitechhid.build.pid=0xc316
micro.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
micro.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

micro.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
micro.menu.keyboardid.logitechgaming.build.vid=0x046d
micro.menu.keyboardid.logitechgaming.build.pid=0xc335
micro.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
micro.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

micro.menu.keyboardid.ms=Microsoft Keyboard
micro.menu.keyboardid.ms.build.vid=0x045e
micro.menu.keyboardid.ms.build.pid=0xfff8
micro.menu.keyboardid.ms.build.usb_product="USB Keyboard"
micro.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

########## Protocol ##########
micro.menu.protocol.auto=Auto (I2C & Serial)
micro.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

micro.menu.protocol.i2c=I2C
micro.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

micro.menu.protocol.serial=Serial
micro.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
micro.menu.debug.serial=Serial (115200b, newline)
micro.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

micro.menu.debug.disabled=Disabled

########## LED ##########
micro.menu.ledpin.disabled=Disabled
micro.menu.ledpin.0=RX (Serial)
micro.menu.ledpin.0.build.led_pin=-DNEOPIXEL -DLED_PIN=0
micro.menu.ledpin.1=TX (Serial)
micro.menu.ledpin.1.build.led_pin=-DNEOPIXEL -DLED_PIN=1
micro.menu.ledpin.2=2 (SDA I2C)
micro.menu.ledpin.2.build.led_pin=-DNEOPIXEL -DLED_PIN=2
micro.menu.ledpin.3=3 (SCL I2C)
micro.menu.ledpin.3.build.led_pin=-DNEOPIXEL -DLED_PIN=3
micro.menu.ledpin.4=4
micro.menu.ledpin.4.build.led_pin=-DNEOPIXEL -DLED_PIN=4
micro.menu.ledpin.5=5
micro.menu.ledpin.5.build.led_pin=-DNEOPIXEL -DLED_PIN=5
micro.menu.ledpin.6=6
micro.menu.ledpin.6.build.led_pin=-DNEOPIXEL -DLED_PIN=6
micro.menu.ledpin.7=7
micro.menu.ledpin.7.build.led_pin=-DNEOPIXEL -DLED_PIN=7
micro.menu.ledpin.8=8
micro.menu.ledpin.8.build.led_pin=-DNEOPIXEL -DLED_PIN=8
micro.menu.ledpin.9=9
micro.menu.ledpin.9.build.led_pin=-DNEOPIXEL -DLED_PIN=9
micro.menu.ledpin.10=10
micro.menu.ledpin.10.build.led_pin=-DNEOPIXEL -DLED_PIN=10
micro.menu.ledpin.11=11
micro.menu.ledpin.11.build.led_pin=-DNEOPIXEL -DLED_PIN=11
micro.menu.ledpin.12=12
micro.menu.ledpin.12.build.led_pin=-DNEOPIXEL -DLED_PIN=12
micro.menu.ledpin.13=13
micro.menu.ledpin.13.build.led_pin=-DNEOPIXEL -DLED_PIN=13
micro.menu.ledpin.14=MI (MISO SPI)
micro.menu.ledpin.14.build.led_pin=-DNEOPIXEL -DLED_PIN=14
micro.menu.ledpin.15=SCK (SCLK SPI)
micro.menu.ledpin.15.build.led_pin=-DNEOPIXEL -DLED_PIN=15
micro.menu.ledpin.16=MO (MOSI SPI)
micro.menu.ledpin.16.build.led_pin=-DNEOPIXEL -DLED_PIN=16
micro.menu.ledpin.17=SS (SPI)
micro.menu.ledpin.17.build.led_pin=-DNEOPIXEL -DLED_PIN=17
micro.menu.ledpin.18=A0
micro.menu.ledpin.18.build.led_pin=-DNEOPIXEL -DLED_PIN=18
micro.menu.ledpin.19=A1
micro.menu.ledpin.19.build.led_pin=-DNEOPIXEL -DLED_PIN=19
micro.menu.ledpin.20=A2
micro.menu.ledpin.20.build.led_pin=-DNEOPIXEL -DLED_PIN=20
micro.menu.ledpin.21=A3
micro.menu.ledpin.21.build.led_pin=-DNEOPIXEL -DLED_PIN=21
micro.menu.ledpin.22=A4
micro.menu.ledpin.22.build.led_pin=-DNEOPIXEL -DLED_PIN=22
micro.menu.ledpin.23=A5
micro.menu.ledpin.23.build.led_pin=-DNEOPIXEL -DLED_PIN=23

########## Serial Bridge ##########
micro.menu.bridge.disabled=Disabled

micro.menu.bridge.serial1=Serial1
micro.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

micro.menu.bridgebutton.disabled=Disabled
micro.menu.bridgebutton.2=2 (SDA I2C)
micro.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
micro.menu.bridgebutton.3=3 (SCL I2C)
micro.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
micro.menu.bridgebutton.4=4
micro.menu.bridgebutton.4.build.bridge_button=-DBRIDGE_SWITCH=4
micro.menu.bridgebutton.5=5
micro.menu.bridgebutton.5.build.bridge_button=-DBRIDGE_SWITCH=5
micro.menu.bridgebutton.6=6
micro.menu.bridgebutton.6.build.bridge_button=-DBRIDGE_SWITCH=6
micro.menu.bridgebutton.7=7
micro.menu.bridgebutton.7.build.bridge_button=-DBRIDGE_SWITCH=7
micro.menu.bridgebutton.8=8
micro.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=8
micro.menu.bridgebutton.9=9
micro.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
micro.menu.bridgebutton.10=10
micro.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
micro.menu.bridgebutton.11=11
micro.menu.bridgebutton.11.build.bridge_button=-DBRIDGE_SWITCH=11
micro.menu.bridgebutton.12=12
micro.menu.bridgebutton.12.build.bridge_button=-DBRIDGE_SWITCH=12
micro.menu.bridgebutton.13=13
micro.menu.bridgebutton.13.build.bridge_button=-DBRIDGE_SWITCH=13
micro.menu.bridgebutton.14=MI (MISO SPI)
micro.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
micro.menu.bridgebutton.15=SCK (SCLK SPI)
micro.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
micro.menu.bridgebutton.16=MO (MOSI SPI)
micro.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
micro.menu.bridgebutton.17=SS (SPI)
micro.menu.bridgebutton.17.build.bridge_button=-DBRIDGE_SWITCH=17
micro.menu.bridgebutton.18=A0
micro.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
micro.menu.bridgebutton.19=A1
micro.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
micro.menu.bridgebutton.20=A2
micro.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20
micro.menu.bridgebutton.21=A3
micro.menu.bridgebutton.21.build.bridge_button=-DBRIDGE_SWITCH=21
micro.menu.bridgebutton.22=A4
micro.menu.bridgebutton.22.build.bridge_button=-DBRIDGE_SWITCH=22
micro.menu.bridgebutton.23=A5
micro.menu.bridgebutton.23.build.bridge_button=-DBRIDGE_SWITCH=23

micro.menu.bridgerst.disabled=Disabled
micro.menu.bridgerst.2=2 (SDA I2C)
micro.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
micro.menu.bridgerst.3=3 (SCL I2C)
micro.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
micro.menu.bridgerst.4=4
micro.menu.bridgerst.4.build.bridge_rst=-DBRIDGE_RST=4
micro.menu.bridgerst.5=5
micro.menu.bridgerst.5.build.bridge_rst=-DBRIDGE_RST=5
micro.menu.bridgerst.6=6
micro.menu.bridgerst.6.build.bridge_rst=-DBRIDGE_RST=6
micro.menu.bridgerst.7=7
micro.menu.bridgerst.7.build.bridge_rst=-DBRIDGE_RST=7
micro.menu.bridgerst.8=8
micro.menu.bridgerst.8.build.bridge_rst=-DBRIDGE_RST=8
micro.menu.bridgerst.9=9
micro.menu.bridgerst.9.build.bridge_rst=-DBRIDGE_RST=9
micro.menu.bridgerst.10=10
micro.menu.bridgerst.10.build.bridge_rst=-DBRIDGE_RST=10
micro.menu.bridgerst.11=11
micro.menu.bridgerst.11.build.bridge_rst=-DBRIDGE_RST=11
micro.menu.bridgerst.12=12
micro.menu.bridgerst.12.build.bridge_rst=-DBRIDGE_RST=12
micro.menu.bridgerst.13=13
micro.menu.bridgerst.13.build.bridge_rst=-DBRIDGE_RST=13
micro.menu.bridgerst.14=MI (MISO SPI)
micro.menu.bridgerst.14.build.bridge_rst=-DBRIDGE_RST=14
micro.menu.bridgerst.15=SCK (SCLK SPI)
micro.menu.bridgerst.15.build.bridge_rst=-DBRIDGE_RST=15
micro.menu.bridgerst.16=MO (MOSI SPI)
micro.menu.bridgerst.16.build.bridge_rst=-DBRIDGE_RST=16
micro.menu.bridgerst.17=SS (SPI)
micro.menu.bridgerst.17.build.bridge_rst=-DBRIDGE_RST=17
micro.menu.bridgerst.18=A0
micro.menu.bridgerst.18.build.bridge_rst=-DBRIDGE_RST=18
micro.menu.bridgerst.19=A1
micro.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
micro.menu.bridgerst.20=A2
micro.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20
micro.menu.bridgerst.21=A3
micro.menu.bridgerst.21.build.bridge_rst=-DBRIDGE_RST=21
micro.menu.bridgerst.22=A4
micro.menu.bridgerst.22.build.bridge_rst=-DBRIDGE_RST=22
micro.menu.bridgerst.23=A5
micro.menu.bridgerst.23.build.bridge_rst=-DBRIDGE_RST=23

micro.menu.bridge0.disabled=Disabled
micro.menu.bridge0.2=2 (SDA I2C)
micro.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
micro.menu.bridge0.3=3 (SCL I2C)
micro.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
micro.menu.bridge0.4=4
micro.menu.bridge0.4.build.bridge_0=-DBRIDGE_0=4
micro.menu.bridge0.5=5
micro.menu.bridge0.5.build.bridge_0=-DBRIDGE_0=5
micro.menu.bridge0.6=6
micro.menu.bridge0.6.build.bridge_0=-DBRIDGE_0=6
micro.menu.bridge0.7=7
micro.menu.bridge0.7.build.bridge_0=-DBRIDGE_0=7
micro.menu.bridge0.8=8
micro.menu.bridge0.8.build.bridge_0=-DBRIDGE_0=8
micro.menu.bridge0.9=9
micro.menu.bridge0.9.build.bridge_0=-DBRIDGE_0=9
micro.menu.bridge0.10=10
micro.menu.bridge0.10.build.bridge_0=-DBRIDGE_0=10
micro.menu.bridge0.11=11
micro.menu.bridge0.11.build.bridge_0=-DBRIDGE_0=11
micro.menu.bridge0.12=12
micro.menu.bridge0.12.build.bridge_0=-DBRIDGE_0=12
micro.menu.bridge0.13=13
micro.menu.bridge0.13.build.bridge_0=-DBRIDGE_0=13
micro.menu.bridge0.14=MI (MISO SPI)
micro.menu.bridge0.14.build.bridge_0=-DBRIDGE_0=14
micro.menu.bridge0.15=SCK (SCLK SPI)
micro.menu.bridge0.15.build.bridge_0=-DBRIDGE_0=15
micro.menu.bridge0.16=MO (MOSI SPI)
micro.menu.bridge0.16.build.bridge_0=-DBRIDGE_0=16
micro.menu.bridge0.17=SS (SPI)
micro.menu.bridge0.17.build.bridge_0=-DBRIDGE_0=17
micro.menu.bridge0.18=A0
micro.menu.bridge0.18.build.bridge_0=-DBRIDGE_0=18
micro.menu.bridge0.19=A1
micro.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
micro.menu.bridge0.20=A2
micro.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20
micro.menu.bridge0.21=A3
micro.menu.bridge0.21.build.bridge_0=-DBRIDGE_0=21
micro.menu.bridge0.22=A4
micro.menu.bridge0.22.build.bridge_0=-DBRIDGE_0=22
micro.menu.bridge0.23=A5
micro.menu.bridge0.23.build.bridge_0=-DBRIDGE_0=23

################################
###### Sparkfun Pro Micro ######
################################

