SpacehuhnTech/arduino/wifiduck/avr/boards.txt
cjmcu.bootloader.tool=avrdude
cjmcu.bootloader.unlock_bits=0x3F
cjmcu.bootloader.lock_bits=0x2F
cjmcu.bootloader.low_fuses=0xFF
cjmcu.bootloader.high_fuses=0xD8

cjmcu.build.board=AVR_ATMEGA32U4
cjmcu.build.core=arduino
cjmcu.build.variant=atmega32u4
cjmcu.build.mcu=atmega32u4

########## 5V / 16MHz ##########
cjmcu.build.f_cpu=16000000L
cjmcu.bootloader.extended_fuses=0xCB
cjmcu.bootloader.file=Caterina-promicro16.hex

########## Keyboard ID ##########
cjmcu.menu.keyboardid.default=Arduino Leonardo
cjmcu.menu.keyboardid.default.build.vid=0x2341
cjmcu.menu.keyboardid.default.build.pid=0x8036
cjmcu.menu.keyboardid.default.build.usb_product="Leonardo"
cjmcu.menu.keyboardid.default.build.usb_manufacturer="Arduino"

cjmcu.menu.keyboardid.apple=Apple Aluminium Keyboard
cjmcu.menu.keyboardid.apple.build.vid=0x05ac
cjmcu.menu.keyboardid.apple.build.pid=0x0221
cjmcu.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
cjmcu.menu.keyboardid.apple.build.usb_manufacturer="Apple"

cjmcu.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
cjmcu.menu.keyboardid.appleint.build.vid=0x05ac
cjmcu.menu.keyboardid.appleint.build.pid=0x0259
cjmcu.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
cjmcu.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

cjmcu.menu.keyboardid.logitechhid=Logitech HID-Compliant Keyboard
cjmcu.menu.keyboardid.logitechhid.build.vid=0x046d
cjmcu.menu.keyboardid.logitechhid.build.pid=0xc316
cjmcu.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
cjmcu.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

cjmcu.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
cjmcu.menu.keyboardid.logitechgaming.build.vid=0x046d
cjmcu.menu.keyboardid.logitechgaming.build.pid=0xc335
cjmcu.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
cjmcu.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

cjmcu.menu.keyboardid.ms=Microsoft Keyboard
cjmcu.menu.keyboardid.ms.build.vid=0x045e
cjmcu.menu.keyboardid.ms.build.pid=0xfff8
cjmcu.menu.keyboardid.ms.build.usb_product="USB Keyboard"
cjmcu.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

########## Protocol ##########
cjmcu.menu.protocol.auto=Auto (I2C & Serial)
cjmcu.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

cjmcu.menu.protocol.i2c=I2C
cjmcu.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

cjmcu.menu.protocol.serial=Serial
cjmcu.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
cjmcu.menu.debug.serial=Serial (115200b, newline)
cjmcu.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

cjmcu.menu.debug.disabled=Disabled

########## LED ##########
cjmcu.menu.ledpin.disabled=Disabled
cjmcu.menu.ledpin.0=RX (Serial)
cjmcu.menu.ledpin.0.build.led_pin=-DNEOPIXEL -DLED_PIN=0
cjmcu.menu.ledpin.1=TX (Serial)
cjmcu.menu.ledpin.1.build.led_pin=-DNEOPIXEL -DLED_PIN=1
cjmcu.menu.ledpin.2=SDA (I2C)
cjmcu.menu.ledpin.2.build.led_pin=-DNEOPIXEL -DLED_PIN=2
cjmcu.menu.ledpin.3=SCL (I2C)
cjmcu.menu.ledpin.3.build.led_pin=-DNEOPIXEL -DLED_PIN=3
cjmcu.menu.ledpin.9=D9
cjmcu.menu.ledpin.9.build.led_pin=-DNEOPIXEL -DLED_PIN=9
cjmcu.menu.ledpin.10=D10
cjmcu.menu.ledpin.10.build.led_pin=-DNEOPIXEL -DLED_PIN=10
cjmcu.menu.ledpin.11=D11
cjmcu.menu.ledpin.11.build.led_pin=-DNEOPIXEL -DLED_PIN=11
cjmcu.menu.ledpin.14=MI (MISO SPI)
cjmcu.menu.ledpin.14.build.led_pin=-DNEOPIXEL -DLED_PIN=14
cjmcu.menu.ledpin.15=SCK (SCLK SPI)
cjmcu.menu.ledpin.15.build.led_pin=-DNEOPIXEL -DLED_PIN=15
cjmcu.menu.ledpin.16=MO (MOSI SPI)
cjmcu.menu.ledpin.16.build.led_pin=-DNEOPIXEL -DLED_PIN=16
cjmcu.menu.ledpin.18=A0
cjmcu.menu.ledpin.18.build.led_pin=-DNEOPIXEL -DLED_PIN=18
cjmcu.menu.ledpin.19=A1
cjmcu.menu.ledpin.19.build.led_pin=-DNEOPIXEL -DLED_PIN=19
cjmcu.menu.ledpin.20=A2
cjmcu.menu.ledpin.20.build.led_pin=-DNEOPIXEL -DLED_PIN=20

########## Serial Bridge ##########
cjmcu.menu.bridge.disabled=Disabled

cjmcu.menu.bridge.serial1=Serial1
cjmcu.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

cjmcu.menu.bridgebutton.disabled=Disabled
cjmcu.menu.bridgebutton.2=SDA (I2C)
cjmcu.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
cjmcu.menu.bridgebutton.3=SCL (I2C)
cjmcu.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
cjmcu.menu.bridgebutton.9=D9
cjmcu.menu.bridgebutton.9.build.bridge_button=-DBRIDGE_SWITCH=9
cjmcu.menu.bridgebutton.10=D10
cjmcu.menu.bridgebutton.10.build.bridge_button=-DBRIDGE_SWITCH=10
cjmcu.menu.bridgebutton.11=D11
cjmcu.menu.bridgebutton.11.build.bridge_button=-DBRIDGE_SWITCH=11
cjmcu.menu.bridgebutton.14=MI (MISO SPI)
cjmcu.menu.bridgebutton.14.build.bridge_button=-DBRIDGE_SWITCH=14
cjmcu.menu.bridgebutton.15=SCK (SCLK SPI)
cjmcu.menu.bridgebutton.15.build.bridge_button=-DBRIDGE_SWITCH=15
cjmcu.menu.bridgebutton.16=MO (MOSI SPI)
cjmcu.menu.bridgebutton.16.build.bridge_button=-DBRIDGE_SWITCH=16
cjmcu.menu.bridgebutton.18=A0
cjmcu.menu.bridgebutton.18.build.bridge_button=-DBRIDGE_SWITCH=18
cjmcu.menu.bridgebutton.19=A1
cjmcu.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
cjmcu.menu.bridgebutton.20=A2
cjmcu.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20

cjmcu.menu.bridgerst.disabled=Disabled
cjmcu.menu.bridgerst.2=SDA (I2C)
cjmcu.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
cjmcu.menu.bridgerst.3=SCL (I2C)
cjmcu.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
cjmcu.menu.bridgerst.9=D9
cjmcu.menu.bridgerst.9.build.bridge_rst=-DBRIDGE_RST=9
cjmcu.menu.bridgerst.10=D10
cjmcu.menu.bridgerst.10.build.bridge_rst=-DBRIDGE_RST=10
cjmcu.menu.bridgerst.11=D11
cjmcu.menu.bridgerst.11.build.bridge_rst=-DBRIDGE_RST=11
cjmcu.menu.bridgerst.14=MI (MISO SPI)
cjmcu.menu.bridgerst.14.build.bridge_rst=-DBRIDGE_RST=14
cjmcu.menu.bridgerst.15=SCK (SCLK SPI)
cjmcu.menu.bridgerst.15.build.bridge_rst=-DBRIDGE_RST=15
cjmcu.menu.bridgerst.16=MO (MOSI SPI)
cjmcu.menu.bridgerst.16.build.bridge_rst=-DBRIDGE_RST=16
cjmcu.menu.bridgerst.18=A0
cjmcu.menu.bridgerst.18.build.bridge_rst=-DBRIDGE_RST=18
cjmcu.menu.bridgerst.19=A1
cjmcu.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
cjmcu.menu.bridgerst.20=A2
cjmcu.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20

cjmcu.menu.bridge0.disabled=Disabled
cjmcu.menu.bridge0.2=SDA (I2C)
cjmcu.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
cjmcu.menu.bridge0.3=SCL (I2C)
cjmcu.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
cjmcu.menu.bridge0.9=D9
cjmcu.menu.bridge0.9.build.bridge_0=-DBRIDGE_0=9
cjmcu.menu.bridge0.10=D10
cjmcu.menu.bridge0.10.build.bridge_0=-DBRIDGE_0=10
cjmcu.menu.bridge0.11=D11
cjmcu.menu.bridge0.11.build.bridge_0=-DBRIDGE_0=11
cjmcu.menu.bridge0.14=MI (MISO SPI)
cjmcu.menu.bridge0.14.build.bridge_0=-DBRIDGE_0=14
cjmcu.menu.bridge0.15=SCK (SCLK SPI)
cjmcu.menu.bridge0.15.build.bridge_0=-DBRIDGE_0=15
cjmcu.menu.bridge0.16=MO (MOSI SPI)
cjmcu.menu.bridge0.16.build.bridge_0=-DBRIDGE_0=16
cjmcu.menu.bridge0.18=A0
cjmcu.menu.bridge0.18.build.bridge_0=-DBRIDGE_0=18
cjmcu.menu.bridge0.19=A1
cjmcu.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
cjmcu.menu.bridge0.20=A2
cjmcu.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20

################################
########### SS Micro ###########
################################

